Tekla Open API Reference for Tekla Structures 2025
ProfileItemParameter.Property Property
 The description of the profile item parameter. Corresponds to the 'Property' in the Tekla Structures profile catalog dialog, and the 'Label in dialog box' in the variable dialog in the Sketch Editor.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Property { get; }
Public ReadOnly Property Property As String
	Get
Property Value
Type: String
See Also
Reference
ProfileItemParameter Class
Tekla.Structures.Catalogs Namespace